In [37]:
import pyodbc
import pandas as pd

In [38]:
cnxn_str = ("Driver={SQL Server Native Client 11.0};"
            "Server=LAPTOP-OSB9U57H;"
            "Database=AdventureWorks2019;"
            "Trusted_Connection=yes;")

cnxn = pyodbc.connect(cnxn_str)

In [39]:
cursor= cnxn.cursor()

In [44]:
query=cursor.execute("INSERT INTO customers (customerid, customerName,ContactName,Country) values (6,'Atul','atulk','Bharat')")

In [45]:
cursor.commit()

In [47]:
data= pd.read_sql("Select * from customers",cnxn)

C:\Users\AtulKadlag\Anaconda3\lib\site-packages\pandas\io\sql.py:762: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

In [48]:
data

   CustomerID     CustomerName      ContactName Country
0           1  Valued Customer       John Smith     USA
1           2             Atul    Alice Johnson   India
2           3  Valued Customer        David Lee      UK
3           4  Valued Customer  Maria Rodriguez   Spain
4           5  Valued Customer   Mohammed Ahmed   Egypt
5           6             Atul            atulk  Bharat

In [49]:
query=cursor.execute("UPDATE customers set CustomerName='Sachin' where CustomerID = 3")

In [50]:
cursor.commit()

In [51]:
query=cursor.execute("DELETE from customers where CustomerID = 6")

In [52]:
cursor.commit()